from typing import Final

TITLE: Final[str] = "🚚 Стоимость доставки"
CURRENT_COST_LABEL: Final[str] = "\n\nТекущая стоимость:"
CURRENT_FREE_DELIVERY_LABEL: Final[str] = "\n\nСумма бесплатной доставки:"
PRICE_FORMAT: Final[str] = "{price} руб."
FREE_DELIVERY_FORMAT: Final[str] = "{free_delivery_amount} руб."
NOT_SET: Final[str] = "не задана"
CREATE_INPUT: Final[str] = "➕ Введите стоимость доставки (числом):"
CREATE_FREE_DELIVERY_INPUT: Final[str] = (
    "➕ Введите сумму для бесплатной доставки (числом):"
)
UPDATE_INPUT: Final[str] = "✏️ Введите новую стоимость доставки (числом):"
UPDATE_FREE_DELIVERY_INPUT: Final[str] = (
    "✏️ Введите новую сумму для бесплатной доставки (числом):"
)
CREATE_CONFIRM: Final[str] = (
    "<b>Подтвердите создание стоимости доставки:</b>\n\n"
    "<b>Стоимость:</b> {price} руб.\n"
    "<b>Бесплатная доставка от:</b> {free_delivery_amount} руб.\n"
)
UPDATE_CONFIRM: Final[str] = (
    "<b>Подтвердите обновление стоимости доставки:</b>\n\n"
    "<b>Стоимость:</b> {price} руб.\n"
    "<b>Бесплатная доставка от:</b> {free_delivery_amount} руб.\n"
)
